name = "Sandro"

print(len(name))  # Len=lenght (სიგრძე) ცვლადი ცვლადში, ითვლის რაოდენობას 

my_sentence = """გამარჯობა შეგახსენებთ რომ სწავლას 
იწყებთ 19 სექტემბერს
გთხოვთ არ გააცდინოთ"""  # """ """ სამი ბრჭყალი იძლევა საშუალებას რომ დაიწეროს დიდი წინადადადება

print(my_sentence)

knows_programming = True

if 10<5: # აუცილებელია ორი წერტილი
    print("hello") # არ გამოისახა რადგან არარის მართებული, იგულისხმება False 
if True:  # if-დარეზერვებული, ჩაშენებული ქიუ ვორდი
    print("hello") # გამოისახება ნებისმიერ შემთხვევაში რადგან True გვაქვს მითითებული
    #tab-ის საშუალებით მოვახდინეთ ინდენტაცია (indentation) (დაშორება კედლიდან)

full_name = "Sandro Kukhaleishvili"
print(len(full_name)) #მივიღეთ 21, მაგრამ არის 20 ასო (სფეისიც ითვლება ყოველთვის)

# ყველა სტრინგი შეგვიძლია მივიჩნიოთ სიად
print(full_name[0]) # გამოსცემს წყობას
# Position = Index [ ]-ინდექსირების ნიშანი
# დათვლის დროს ვიწყებთ 0-ით და ითვლება სფეისიც
print(full_name[7])

print("k" not in full_name) # გვიჩვენებს არის თუ არა ესა თუ ის ასო ჩვენს ცვლადში
print("s" in full_name) # ორივე მეთოდით შეიძლება, ასო არის, ასო არ არის შესაბამისად გამოაქვს False & True

print(full_name[2:7]) # Slize - დაჭრა, გვიჩვენებს 2-დან 7მდე ცვლადს
                      # : ნიშნავს დიაპაზონს
print(full_name[2:7:2]) # 2-დან 7-მდე ყოველი მეორე გამოაქვს (გადაახტა ყოველ მეორეს)    
                        # start:finish:step
print(full_name[:6]) # დასაწისიდან 6-ის ჩათვლით    
print(full_name[7:]) # რომელიღაც ცვლადიდან ბოლომდე

print(full_name[-1]) # გვიჩვენებს ბოლო სიმბოლოს
print(full_name[-4]) 

print(full_name[-4]+"abc") # გადავაბათ ოპერაციები ერთმანეთს
print(full_name[-1:-6:-2])

# სტრინგებს აქთ მეთოები
# 1) რაღაც სტრინგს.upper() (წერტილით გამოიძახო მეთოდით და upper-ით ზრდის პატარა ასოს დიდ ასოთ)
# 2) Len(სტრინგ)   

print(full_name.upper()) # გაზარდა ასო

name2 = "SANDRO"
print(name2.lower()) # დააპატარავა     

name2 = "    SANDRO     "
print(name2.strip()) #აჭრის ზედმეტ სფეისებს

print(name2.replace(" ", "#")) #ჩაანაცვლოს კონკრეტული რაღაც სხვა რამით
name3 = "Kukhaleishvili"
print(name3.replace("i", "!"))


